<?php
return [

    'failed' => 'هذه البيانات لا تتطابق مع سجلاتنا.',
    'password' => 'كلمة المرور المقدمة غير صحيحة.',
    'throttle' => 'الكثير من محاولات تسجيل الدخول. يرجى المحاولة مرة أخرى في :seconds ثانية.',


    't_forgot_password' => 'نسيت كلمة المرور!',
    'p_forgot_password' => 'يرجى إدخال بريدك الإلكتروني',
    't_reset_password' => 'إعادة تعيين كلمة المرور!',
    'p_reset_password' => 'يرجى إدخال كلمة المرور الجديده',
    'send' => 'ارسال',
    'btn_reset' => 'إعادة تعيين كلمة المرور',

];