<?php

return [
    'case_type' => 'انواع الحالات',
    'btn_create_case_type' => 'اضافة نوع حاله',
    'name_case_type' => 'اسم الحالة',
    'name_case_ar'=> 'اسم الحاله بالعربية',
    'name_case_en' => 'اسم الحاله بالانجليزيه',
    'created_at' => 'تاريخ الاضافة',

    //validation
    'ar.name.required' => 'حقل الاسم بالعربية مطلوب.',
    'en.name.required' => 'حقل الاسم بالانجليزيه مطلوب.',
    'name.string' => 'يجب أن يكون الاسم نصًا.',
    'name.min' => 'يجب أن يحتوي الاسم على الأقل على :min أحرف.',
    'name.max' => 'لا يجب أن يتجاوز الاسم :max أحرف.',
    'ar.name.unique' => 'تم اختيار هذا الاسم بالعربية مسبقًا.',
    'en.name.unique' => 'تم اختيار هذا الاسم بالانجليزيه مسبقًا.',



];
