<?php


return [
    'error' => 'خطأ',
    'add' => 'تم حفظ البيانات بنجاح',
    'edit' => 'تم تعديل البيانات بنجاح',
    'delete' => 'تم حذف البيانات بنجاح',
    'status' => 'تم تغير الحالة بنجاح',
    'send' => 'تم ارسال الطلب بنجاح',
    'no-case_type' => 'يجب اضافة على الاقل حالة واحد لهذا القسم',
    'no-department' => 'يجب اضافة على الاقل قسم واحد',
    'no-services' => 'يجب اضافة على الاقل خدمة واحده',
    'no-id' => 'هذا الكيان غير موجود',
    'no-edit-medication' => 'لا يمكن تغيير حالة صرف الدواء',
    'medication-dispensed' => 'في حالة تم صرفه',    
    'medication-undispensed' => 'في حالة عدم صرفه بعد',    
    'medication-no-auth-edit' => 'لعدم وجود صلاحية لوصف الدواء',    
    'status_unathorized' => 'لا يحق لك الوصول لحسابك بسبب اغلاقه',
    'must-medciation-taken' => 'لا يجوز اعطاء بديل بدون تغير حالة الصرف لدواء',
];