<?php

return [

    'project_title' => 'نظام العيادات المركزي',


    'select_package_placeholder' => 'إختر من القائمة',

    'caption_welcome' => 'مرحبا بعودتك',

    'back' => 'رجوع',

    'search' => 'بحث',
    
    'show' => 'عرض',

    'in_department' => 'في قسم',



    //calendar
    'today' => 'اليوم',
    'month' => 'شهر',
    'day' => 'يوم',
    'all-day' => 'طوال اليوم',


    //website 
    'personal_account' => 'الملف الشخصي',
    'call_us' => 'اتصل بنا',
    'support' => 'الدعم والمساعدة',
    'logout' => 'تسجيل الخروج',
    'login' => 'تسجيل الدخول',
    'about_us' => 'من نحن؟',

    'about_us_title' => 'ما هو نظام العيادات المركزي؟',
    'about_us_text' => 'هو نظام شامل لربط العيادات و الصيدليات و مقدمي الرعاية الصحية, يسهل النظام ادارة سجلات المرضى والمواعيد و الوصفات الطبيه و الصيدليات و يبسط التواصل بين العيادات و الاطباء و الصيادلة',

    'feature_one_title' => 'الاطلاع على السجل الطبي',
    'feature_one_text' => 'يمكنك النظام بالاطلاع على معلومات سجلك الطبي اذا كنت تراجع العيادات و الصيدليات التي تتبع لشبكة العيادات المركزية ومن ضمنها : المواعيد الطبية في عيادات الاختصاص , الادوية الفعالة , المطاعيم , تقارير الاشعة ,الجراحة ,نتائج التحاليل ',

    'feature_two_title' => 'صرف دواء للمريض في السجل',
    'feature_two_text' => 'يتم وصف دواء مناسب من الطبيب على حسب حالة المريض ويتم اضافتها بالسجل الخاص به وعن طريقه يتم صرفه من الصيدلاني للمريض عن طريق النظام الخاص بنا',

    'feature_three_title' => 'حجز موعد متابعة',
    'feature_three_text' => 'تمكنك هذه الخدمة بحجز موعد عند الطبيب او القسم الذي تحتاجه و عرض جدول زمني لمواعيد الطبيب المتاحة و تحديد الوقت الذي يناسب الطبيب من بين الأوقات المتاحة ويمكنك إدارة المواعيد المحجوزة مثل تعديلها او الغائها اذا لزم الامر ',


    'social_media' => 'تابعنا عبر مواقع التواصل',
    
    'footer_text' => 'حقوق الطبع والنشر &copy; 2024 من قبل الفريق جميع الحقوق محفوظة.',


    //error page
    'h_404' => 'عذرًا. الصفحة التي كنت تبحث عنها غير موجودة.',
    'p_404' => 'ربما تكون قد أخطأت في كتابة العنوان أو ربما تم نقل الصفحة.',
    'h_403' => 'عذرًا! تم رفض الوصول',
    'p_403' => ' ليس لديك الإذن للوصول إلى هذه الصفحة. يُرجى التحقق مما إذا أدخلت الرابط الصحيح. شكرًا لتفهمك.',

    'btn_back_home' => 'العودة لصفحة الرئيسية',
];
