<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | تحتوي السطور اللغوية التالية على رسائل الخطأ الافتراضية المستخدمة من قبل
    | فئة المحقق. بعض هذه القواعد لديها إصدارات متعددة مثل قواعد الحجم.
    | لا تتردد في تعديل كل هذه الرسائل هنا.
    |
    */

    //validation    
    'accepted' => 'يجب قبول الحقل.',
    'active_url' => 'الحقل ليس عنوان URL صحيح.',
    'after' => 'الحقل يجب أن يكون تاريخًا بعد :date.',
    'after_or_equal' => 'الحقل يجب أن يكون تاريخًا بعد أو يساوي :date.',
    'alpha' => 'الحقل يجب أن يحتوي على أحرف فقط.',
    'alpha_dash' => 'الحقل يجب أن يحتوي على أحرف وأرقام وشرطات وشرطات سفلية فقط.',
    'alpha_num' => 'الحقل يجب أن يحتوي على أحرف وأرقام فقط.',
    'array' => 'الحقل يجب أن يكون مصفوفة.',
    'before' => 'الحقل يجب أن يكون تاريخًا قبل :date.',
    'before_or_equal' => 'الحقل يجب أن يكون تاريخًا قبل أو يساوي :date.',
    'between' => [
        'numeric' => 'الحقل يجب أن يكون بين :min و :max.',
        'file' => 'الحقل يجب أن يكون بين :min و :max كيلوبايت.',
        'string' => 'الحقل يجب أن يكون بين :min و :max خانات.',
        'array' => 'الحقل يجب أن يحتوي على بين :min و :max عنصر.',
    ],
    'boolean' => 'يجب أن يكون الحقل صحيحًا أو خاطئًا.',
    'confirmed' => 'تأكيد الحقل غير متطابق.',
    'date' => 'الحقل ليس تاريخًا صحيحًا.',
    'date_equals' => 'الحقل يجب أن يكون تاريخًا يساوي :date.',
    'date_format' => 'الحقل لا يتناسب مع التنسيق :format.',
    'different' => 'الحقل و :other يجب أن يكونوا مختلفين.',
    'digits' => 'الحقل يجب أن يكون :digits أرقام.',
    'digits_between' => 'الحقل يجب أن يكون بين :min و :max أرقام.',
    'dimensions' => 'الحقل يحتوي على أبعاد صورة غير صالحة.',
    'distinct' => 'الحقل يحتوي على قيمة مكررة.',
    'email' => 'الحقل يجب أن يكون عنوان بريد إلكتروني صحيح.',
    'ends_with' => 'الحقل يجب أن ينتهي بأحد القيم التالية: :values.',
    'exists' => 'الحقل المحدد غير صحيح.',
    'file' => 'الحقل يجب أن يكون ملفًا.',
    'filled' => 'يجب أن يحتوي الحقل على قيمة.',
    'gt' => [
        'numeric' => 'الحقل يجب أن يكون أكبر من :value.',
        'file' => 'الحقل يجب أن يكون أكبر من :value كيلوبايت.',
        'string' => 'الحقل يجب أن يكون أكبر من :value خانات.',
        'array' => 'الحقل يجب أن يحتوي على أكثر من :value عنصر.',
    ],
    'gte' => [
        'numeric' => 'الحقل يجب أن يكون أكبر من أو يساوي :value.',
        'file' => 'الحقل يجب أن يكون أكبر من أو يساوي :value كيلوبايت.',
        'string' => 'الحقل يجب أن يكون أكبر من أو يساوي :value خانات.',
        'array' => 'الحقل يجب أن يحتوي على :value عنصر أو أكثر.',
    ],
    'image' => 'الحقل يجب أن يكون صورة.',
    'in' => 'الحقل المحدد غير صحيح.',
    'in_array' => 'الحقل غير موجود في :other.',
    'integer' => 'الحقل يجب أن يكون عددًا صحيحًا.',
    'ip' => 'الحقل يجب أن يكون عنوان IP صحيحًا.',
    'ipv4' => 'الحقل يجب أن يكون عنوان IPv4 صحيحًا.',
    'ipv6' => 'الحقل يجب أن يكون عنوان IPv6 صحيحًا.',
    'json' => 'الحقل يجب أن يكون سلسلة JSON صحيحة.',
    'lt' => [
        'numeric' => 'الحقل يجب أن يكون أقل من :value.',
        'file' => 'الحقل يجب أن يكون أقل من :value كيلوبايت.',
        'string' => 'الحقل يجب أن يكون أقل من :value خانات.',
        'array' => 'الحقل يجب أن يحتوي على أقل من :value عنصر.',
    ],
    'lte' => [
        'numeric' => 'الحقل يجب أن يكون أقل من أو يساوي :value.',
        'file' => 'الحقل يجب أن يكون أقل من أو يساوي :value كيلوبايت.',
        'string' => 'الحقل يجب أن يكون أقل من أو يساوي :value خانات.',
        'array' => 'الحقل يجب أن لا يحتوي على أكثر من :value عنصر.',
    ],
    'max' => [
        'numeric' => 'الحقل يجب أن لا يكون أكبر من :max.',
        'file' => 'الحقل يجب أن لا يكون أكبر من :max كيلوبايت.',
        'string' => 'الحقل يجب أن لا يكون أكبر من :max خانات.',
        'array' => 'الحقل يجب أن لا يحتوي على أكثر من :max عنصر.',
    ],
    'mimes' => 'الحقل يجب أن يكون ملفًا من النوع: :values.',
    'mimetypes' => 'الحقل يجب أن يكون ملفًا من النوع: :values.',
    'min' => [
        'numeric' => 'الحقل يجب أن يكون على الأقل :min.',
        'file' => 'الحقل يجب أن يكون على الأقل :min كيلوبايت.',
        'string' => 'الحقل يجب أن يكون على الأقل :min خانات.',
        'array' => 'الحقل يجب أن يحتوي على على الأقل :min عنصر.',
    ],
    'multiple_of' => 'الحقل يجب أن يكون مضاعفًا للقيمة :value.',
    'not_in' => 'الحقل المحدد غير صحيح.',
    'not_regex' => 'تنسيق الحقل غير صحيح.',
    'numeric' => 'الحقل يجب أن يكون رقمًا.',
    'password' => 'كلمة المرور غير صحيحة.',
    'present' => 'يجب أن يكون الحقل موجودًا.',
    'regex' => 'تنسيق الحقل غير صحيح.',
    'required' => 'الحقل مطلوب.',
    'required_if' => 'يجب أن يكون الحقل مطلوبًا عندما يكون :other هو :value.',
    'required_unless' => 'يجب أن يكون الحقل مطلوبًا ما لم يكن :other في :values.',
    'required_with' => 'يجب أن يكون الحقل مطلوبًا عندما يكون :values موجودًا.',
    'required_with_all' => 'يجب أن يكون الحقل مطلوبًا عندما تكون :values موجودة.',
    'required_without' => 'يجب أن يكون الحقل مطلوبًا عندما لا يكون :values موجودًا.',
    'required_without_all' => 'يجب أن يكون الحقل مطلوبًا عندما لا تكون :values موجودة.',
    'prohibited' => 'الحقل ممنوع.',
    'prohibited_if' => 'الحقل ممنوع عندما يكون :other هو :value.',
    'prohibited_unless' => 'الحقل ممنوع ما لم يكن :other في :values.',
    'same' => 'الحقل و :other يجب أن يتطابقوا.',
    'size' => [
        'numeric' => 'الحقل يجب أن يكون :size.',
        'file' => 'الحقل يجب أن يكون :size كيلوبايت.',
        'string' => 'الحقل يجب أن يكون :size حرفًا.',
        'array' => 'الحقل يجب أن يحتوي على :size عنصر.',
    ],
    'starts_with' => 'الحقل يجب أن يبدأ بأحد القيم التالية: :values.',
    'string' => 'الحقل يجب أن يكون نصًا.',
    'timezone' => 'الحقل يجب أن يكون منطقة زمنية صحيحة.',
    'unique' => 'الحقل تم اتخاذه بالفعل.',
    'uploaded' => 'فشل في تحميل الحقل.',
    'url' => 'تنسيق الحقل غير صحيح.',
    'uuid' => 'حقل يجب أن يكون UUID صحيح.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
